In [1]:
import pandas as pd
import glob

## Extract

In [2]:
#ExtrACT all HTML files
df = pd.concat(map(pd.read_csv, glob.glob('test_input' + '\*.html')))
#Extract All source code
#https://stackoverflow.com/questions/20906474/import-multiple-csv-files-into-pandas-and-concatenate-into-one-dataframe

In [3]:
df.head()

  <table border="1" class="dataframe">
0                              <thead>
1      <tr style="text-align: right;">
2                            <th></th>
3                        <th>City</th>
4                  <th>Cloudiness</th>

In [4]:
len(df)

6593

## Transform

In [5]:
df['hash'] = pd.Series((hash(tuple(row)) for _, row in df.iterrows()))
#Hash Code
#https://stackoverflow.com/questions/25757042/create-hash-value-for-each-row-of-data-with-selected-columns-in-dataframe-in-pyt
df.head()

  <table border="1" class="dataframe">                 hash
0                              <thead>   568949498526711183
1      <tr style="text-align: right;"> -6223976376742230798
2                            <th></th> -4992631946993318175
3                        <th>City</th>  2148014252352411027
4                  <th>Cloudiness</th> -3103486328942662228

In [6]:
len(df)

6593

In [7]:
df_nodupe = df[~df.duplicated()]
#Dedupe code source
#https://stackoverflow.com/questions/40438237/assign-hash-to-row-of-categorical-data-in-pandas

In [8]:
df_nodupe.head()

  <table border="1" class="dataframe">                 hash
0                              <thead>   568949498526711183
1      <tr style="text-align: right;"> -6223976376742230798
2                            <th></th> -4992631946993318175
3                        <th>City</th>  2148014252352411027
4                  <th>Cloudiness</th> -3103486328942662228

In [9]:
len(df_nodupe)

3014

## Load

#### > Convert DataFrame to json formatted file

In [10]:
import json

In [11]:
df_nodupe.to_json('ETL_json_file', orient='index')
# Converting dataframe data to json format
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_json.html

In [12]:
json_data = df_nodupe.to_json(orient='index')
parsed = json.loads(json_data)
# print(json.dumps(parsed, indent=4, sort_keys=True))
# Un-comment print to pretty print json formated data

#### > Create MongoDB named 'etl_db' with a collection 'etl_data'

In [13]:
import pymongo
from pymongo import MongoClient
client = MongoClient()
client = MongoClient('localhost', 27017)
client = MongoClient('mongodb://localhost:27017/')
print('Mongo version', pymongo.__version__)

Mongo version 3.9.0

In [14]:
# Uncomment code to drop existing database before creating new one
# client.drop_database('etl_db')

In [15]:
db = client['etl_db']
# Create database named 'etl_db'

db.etl_data.drop() # Drop collection if it already exist

collection = db['etl_data']
# Create collection called 'etl_data'

#### > Load ETL_json_file data

In [16]:
with open('ETL_json_file') as f:
    file_data = json.load(f)
    collection.insert_one(file_data) 
client.close()
# Read json file into mongoDB
# https://stackoverflow.com/questions/49510049/how-to-import-json-file-to-mongodb-using-python

In [17]:
db.list_collection_names()
# List collections in database

['etl_data']

In [18]:
db.etl_data.find( { 0: {} } )

In [19]:
# cursor = db.etl_data # selecting the etl_data collection
# for document in cursor.find():
#    print (document)
# Printing the content of the collection LARGE PRINTOUT

#### > Reading content of database and loading it into a dataframe

In [20]:
extracted_etl_data = db.etl_data
df = pd.DataFrame(list(extracted_etl_data.find()))
# https://stackoverflow.com/questions/16249736/how-to-import-data-from-mongodb-to-pandas

In [21]:
df

,0,1,10,100,101,102,103,104,105,106,...,91,92,93,94,95,96,97,98,99,_id
0,"{'City_ID': 0, 'City': 'jacareacanga', 'Cloudi...","{'City_ID': 1, 'City': 'kaitangata', 'Cloudine...","{'City_ID': 10, 'City': 'puerto ayora', 'Cloud...","{'City_ID': 100, 'City': 'auchel', 'Cloudiness...","{'City_ID': 101, 'City': 'bubaque', 'Cloudines...","{'City_ID': 102, 'City': 'khatanga', 'Cloudine...","{'City_ID': 103, 'City': 'los banos', 'Cloudin...","{'City_ID': 104, 'City': 'labuhan', 'Cloudines...","{'City_ID': 105, 'City': 'saint-paul', 'Cloudi...","{'City_ID': 106, 'City': 'petatlan', 'Cloudine...",...,"{'City_ID': 91, 'City': 'mataura', 'Cloudiness...","{'City_ID': 92, 'City': 'buala', 'Cloudiness':...","{'City_ID': 93, 'City': 'eyl', 'Cloudiness': 2...","{'City_ID': 94, 'City': 'abu dhabi', 'Cloudine...","{'City_ID': 95, 'City': 'tahe', 'Cloudiness': ...","{'City_ID': 96, 'City': 'chuy', 'Cloudiness': ...","{'City_ID': 97, 'City': 'dzerzhinskoye', 'Clou...","{'City_ID': 98, 'City': 'vanavara', 'Cloudines...","{'City_ID': 99, 'City': 'muros', 'Cloudiness':...",5d6ad415c31aee57c57220a3

In [22]:
df = df.melt()

In [23]:
df.head()

  variable                                              value
0        0  {'City_ID': 0, 'City': 'jacareacanga', 'Cloudi...
1        1  {'City_ID': 1, 'City': 'kaitangata', 'Cloudine...
2       10  {'City_ID': 10, 'City': 'puerto ayora', 'Cloud...
3      100  {'City_ID': 100, 'City': 'auchel', 'Cloudiness...
4      101  {'City_ID': 101, 'City': 'bubaque', 'Cloudines...

In [24]:
len(df)

549

In [25]:
df.iloc[0][1]
# Showing content of first row 'value'

{'City_ID': 0,
 'City': 'jacareacanga',
 'Cloudiness': 0,
 'Country': 'BR',
 'Date': 1528902000,
 'Humidity': 62,
 'Lat': -6.22,
 'Lng': -57.76,
 'Max Temp': 89.6,
 'Wind Speed': 6.93,
 'hash': -1514993554194462186}

#### > CSV Move script - moves .csv files after being ETL processed

In [26]:
import shutil, os, glob

In [27]:
#For Loop moving all .csv files from the test_input folder 
for filePath in glob.glob('test_input' + '\*.csv'):
            #Move each file to the destination directory
        shutil.move(filePath, 'test_processed');
# Move all files that have been ETL'ed into a processed folder
#Source Code           
#https://thispointer.com/python-how-to-move-files-and-directories/